<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\AssociationCampaign;
use Carbon\Carbon;
use Illuminate\Support\Facades\Storage;
use Illuminate\Support\Facades\File;

class AssociationCampaignsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
    $titles = [
        'مبادرة دعم الصحة',
        'حملة توفير المستلزمات التعليمية',
        'تنظيف الحي',
        'حملة زراعة الأشجار',

        'عملية قلب مفتوح لمسن',
        'تجهيز مدرسة في منطقة نائية',
        'حملة تنظيف مستشفى المجتهد',
        'حملة فرز النفايات الصلبة',
        'تكفل مريض غسيل كلى',
        'حملة تأمين مازوت للمدارس',
        'الرسم على جدران جسر الحرية',  //11
        

        'مبادرة دعم الصحة',
        'حملة توفير المستلزمات التعليمية',
        'تنظيف الحي',
        'حملة زراعة الأشجار',

        'عملية قلب مفتوح لمسن',
        'تجهيز مدرسة في منطقة نائية',
        'حملة تنظيف مستشفى المجتهد',
        'حملة فرز النفايات الصلبة',

        'تكفل مريض غسيل كلى',
        'حملة تأمين مازوت للمدارس',
        'الرسم على جدران جسر الحرية',  //22

        'مبادرة دعم الصحة',
        'حملة توفير المستلزمات التعليمية',
        'تنظيف الحي',
        'حملة زراعة الأشجار',

        'عملية قلب مفتوح لمسن',
        'تجهيز مدرسة في منطقة نائية',
        'حملة تنظيف مستشفى المجتهد',
        'حملة فرز النفايات الصلبة',

        'تكفل مريض غسيل كلى',
        'حملة تأمين مازوت للمدارس',
        'الرسم على جدران جسر الحرية',  //33
    ];

    $descriptions = [
        'تقديم المساعدة الطبية للمجتمعات المحرومة.',
        'توفير الكتب والمواد للطلاب ذوي الدخل المنخفض.',
        'تنظيم حدث تنظيف على مستوى المجتمع.',
        'زراعة الأشجار لتحسين جودة الهواء والبيئة.',

        'مسن في مستشفى المجتهد بحاجة لعملية قلب مفتوح وليس لديه القدرة على تكاليف العملية',
        'افتتاح مدرسة جديدة في منطقة دنون بحاجة لمستلزمات عددة من مدافئ/طباشير/ألواح',
        'المساعدة في تنظيف مستشفى المجتهد وتعقيم عياداتها وغرفها كافة',
        'عند مكب النفايات في منطقة الكسوة سنقوم بفرز النفايات الصلبة لإعادى تدويرها حفاظا على البيئة',

        'شاب مريض بحاجة لغسيل كلى دوري كل شهر في مستشفى المجتهد وبحاجة لنقل دم كل 6 أشهر',
        'ثلاث مدارس في منطقة غباغب بحاجة لمازوت للغرف الصفية للأطفال',
        'لسوريا جديدة مليئة بالأمل سنقوم بتزيين جسر الحرية برموز الثورة وأعلامها',

        //////////
       'تقديم المساعدة الطبية للمجتمعات المحرومة.',
        'توفير الكتب والمواد للطلاب ذوي الدخل المنخفض.',
        'تنظيم حدث تنظيف على مستوى المجتمع.',
        'زراعة الأشجار لتحسين جودة الهواء والبيئة.',

        'مسن في مستشفى المجتهد بحاجة لعملية قلب مفتوح وليس لديه القدرة على تكاليف العملية',
        'افتتاح مدرسة جديدة في منطقة دنون بحاجة لمستلزمات عددة من مدافئ/طباشير/ألواح',
        'المساعدة في تنظيف مستشفى المجتهد وتعقيم عياداتها وغرفها كافة',
        'عند مكب النفايات في منطقة الكسوة سنقوم بفرز النفايات الصلبة لإعادى تدويرها حفاظا على البيئة',

        'شاب مريض بحاجة لغسيل كلى دوري كل شهر في مستشفى المجتهد وبحاجة لنقل دم كل 6 أشهر',
        'ثلاث مدارس في منطقة غباغب بحاجة لمازوت للغرف الصفية للأطفال',
        'لسوريا جديدة مليئة بالأمل سنقوم بتزيين جسر الحرية برموز الثورة وأعلامها',

        //////

        'تقديم المساعدة الطبية للمجتمعات المحرومة.',
        'توفير الكتب والمواد للطلاب ذوي الدخل المنخفض.',
        'تنظيم حدث تنظيف على مستوى المجتمع.',
        'زراعة الأشجار لتحسين جودة الهواء والبيئة.',

        'مسن في مستشفى المجتهد بحاجة لعملية قلب مفتوح وليس لديه القدرة على تكاليف العملية',
        'افتتاح مدرسة جديدة في منطقة دنون بحاجة لمستلزمات عددة من مدافئ/طباشير/ألواح',
        'المساعدة في تنظيف مستشفى المجتهد وتعقيم عياداتها وغرفها كافة',
        'عند مكب النفايات في منطقة الكسوة سنقوم بفرز النفايات الصلبة لإعادى تدويرها حفاظا على البيئة',

        'شاب مريض بحاجة لغسيل كلى دوري كل شهر في مستشفى المجتهد وبحاجة لنقل دم كل 6 أشهر',
        'ثلاث مدارس في منطقة غباغب بحاجة لمازوت للغرف الصفية للأطفال',
        'لسوريا جديدة مليئة بالأمل سنقوم بتزيين جسر الحرية برموز الثورة وأعلامها',

    ];

        $photos = [
            'health (1).jpg',
            'health (2).jpg',
            'clean (1).jpg',
            'envo (1).jpg',
            '11.jpg',
            '12.jpg',
            '13.jpg',
            '14.jpg',
            '15.jpg',
            '16.jpg',
            '17.jpg'
                ];

        $fullPaths = [];

        $sourceDir = public_path('uploads/seeder_photos/');
        $targetDir = 'uploads/assocCampignsphotos/';

        foreach ($photos as $photo) {
            $sourcePath = $sourceDir . $photo;
            $targetPath = $targetDir . $photo;

            if (File::exists($sourcePath)) {
                Storage::disk('public')->put($targetPath, File::get($sourcePath));

                // $fullPath = url(Storage::url($targetPath));
                $fullPath =  $targetPath;

                $fullPaths[] = $fullPath;
            } else {
                $fullPaths[] = null;
            }
        }






$classificationIds = [1, 2, 3, 4 , 1, 2, 3, 4 , 1, 2, 3
        , 1, 2, 3, 4 , 1, 2, 3, 4 , 1, 2, 3
    , 1, 2, 3, 4 , 1, 2, 3, 4 , 1, 2, 3]; // healthy, Educational, cleanliness, environmental

$statusIds = [2, 1, 2 , 3 , 2, 1, 2 , 3 , 2, 1, 2
        ,2, 1, 2 , 3 , 2, 1, 2 , 3 , 2, 1, 2
    ,2, 1, 2 , 3 , 2, 1, 2 , 3 , 2, 1, 2]; // Active, Closed, Complete


        $tasks_start_time = ['08:00:00' , '10:30:00', '13:00:00', '15:45:00' ,
'08:00:00' , '10:30:00', '13:00:00', '15:45:00',
'08:00:00' , '10:30:00', '13:00:00', '15:45:00',
'08:00:00' , '10:30:00', '13:00:00', '15:45:00',
'08:00:00' , '10:30:00', '13:00:00', '15:45:00',
'08:00:00' , '10:30:00', '13:00:00', '15:45:00',
'08:00:00' , '10:30:00', '13:00:00', '15:45:00',
'08:00:00' , '10:30:00', '13:00:00', '15:45:00','08:00:00'];

        $tasks_end_time = ['09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00',
'09:30:00' , '12:00:00' , '14:30:00' , '17:00:00','09:30:00' ];




$locations = [
'دمشق - المزة',           //1
'حلب - الشهباء',          //2
'حمص - شارع الدبلان',      //3
'اللاذقية - الشاطئ' ,      //4
'حماة - مورك' ,            //5
'طرطوس - الناحية',         //6
'إدلب - الدنا',            //7
'درعا - ساحة الدلة',      //8
'دمشق - الميدان' ,        //9
    'دمشق - المخيم',         //10
'دمشق - المخيم' ,          //11

/////////////////////// تكرار للتوزيع على الجمعيات

'دمشق - المزة',           //1
'حلب - الشهباء',          //2
'حمص - شارع الدبلان',      //3
'اللاذقية - الشاطئ' ,      //4
'حماة - مورك' ,            //5
'طرطوس - الناحية',         //6
'إدلب - الدنا',            //7
'درعا - ساحة الدلة',      //8
'دمشق - الميدان' ,        //9
'دمشق - المخيم',           //10
'دمشق - المخيم'     ,      //22

'دمشق - المزة',           //1
'حلب - الشهباء',          //2
'حمص - شارع الدبلان',      //3
'اللاذقية - الشاطئ' ,      //4
'حماة - مورك' ,            //5
'طرطوس - الناحية',         //6
'إدلب - الدنا',            //7
'درعا - ساحة الدلة',      //8
'دمشق - الميدان' ,        //9
'دمشق - المخيم' ,             //10
    'دمشق - المخيم'           //33
];


$amounts = [70000,50000,100000,20000,30000,20000,30000,50000,40000,100000,40000,
70000,50000,100000,20000,30000,20000,30000,50000,40000,100000,40000
,70000,50000,100000,20000,30000,20000,30000,50000,40000,100000,40000];


$emergency_level = [1,2,2,5,3,2,3,5,4,1,4 , 1,2,2,5,3,2,3,5,4,1,4 , 1,2,2,5,3,2,3,5,4,1,4];





        for ($i = 0; $i < 33; $i++) {

            $photoIndex = $i % count($photos);


            AssociationCampaign::create([
                'classification_id' => $classificationIds[$i],
                'title' => $titles[$i],
                'description' => $descriptions[$i],
                'location' => $locations[$i],
                'amount_required' => $amounts[$i],
                'campaign_status_id' => $statusIds[$i],
                'photo' => $fullPaths[$photoIndex],
                'tasks_start_time' => $tasks_start_time[$i],
                'tasks_end_time' => $tasks_end_time[$i],
                'emergency_level' => $emergency_level[$i],
                'compaigns_time' => rand(7, 30),
                'compaigns_start_time' => Carbon::now()->subDays(rand(1, 10)),
                'compaigns_end_time' => Carbon::now()->addDays(rand(10, 30)),
            ]);
        }
    }
}
