<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Center;

class CentersSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $names = [
            'مركز الهلال الأحمر',      //1
            'مركز الإغاثة الإنسانية',  //2
            'مركز التبرعات العامة',  //3
            'مركز نقطة حليب',        //4
            'مركز عطايا الخير',      //5
            'مركز سند',               //6
            'مركز كن عونا',           //7
            'مركز حوران المركزي' ,     //8
            ' مركز الإحسان' ,           //9
            'مركز ارتقاء'              //10
        ];

        $locations = [
            'دمشق - المزة',           //1
            'حلب - الشهباء',          //2
            'حمص - شارع الدبلان',      //3
            'اللاذقية - الشاطئ' ,      //4
            'حماة - مورك' ,            //5
            'طرطوس - الناحية',         //6
            'إدلب - الدنا',            //7
            'درعا - ساحة الدلة',      //8
            'دمشق - الميدان' ,        //9
            'دمشق - المخيم'           //10
        ];

        $space = [
            '200',    //1
            '222',    //2
            '800',     //3
            '1000',    //4
            '2000',    //5
            '635',     //6
            '7634',    //7
            '3763',    //8
            '400',     //9
            '900'      //10

         ];
        $have_frez = [
            '1',
            '1',
            '0',
            '0',
            '1',
            '1',
            '1',
            '0',
            '1',
            '1'
         ];

        for ($i = 0; $i < count($names); $i++) {
            Center::create([
                'center_name' => $names[$i],
                'location'    => $locations[$i],
                'space' => $space[$i],
                'have_frez' => $have_frez[$i]
            ]);
        }
    }
}

