<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\IndCompaign;
use Carbon\Carbon;

class IndividualCompaignsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $titles = [
            'دعم علاج السرطان',               //1
            'كتب لدار الأيتام',               //2
            'تنظيف الحي',                     //3
            'مبادرة زراعة الأشجار',            //4
            'المساعدات الطبية للاجئين',         //5
            'أدوات تعليمية للأطفال في المناطق الريفية',  //6
            'حملة جمع النفايات',       //7
            'مراقبة جودة الهواء',      //8
            'الدعم الصحي الطارئ',      //9
            'المنح الدراسية للطلاب',    //10
            'حملة تنظيف الشاطئ' ,       //11


/////////////////تكرار مشان التوزيع عالمستخدمين

            'دعم علاج السرطان',               //12
            'كتب لدار الأيتام',               //13
            'تنظيف الحي',                     //14
            'مبادرة زراعة الأشجار',            //15
            'المساعدات الطبية للاجئين',         //16
            'أدوات تعليمية للأطفال في المناطق الريفية',  //17
            'حملة جمع النفايات',       //18
            'مراقبة جودة الهواء',      //19
            'الدعم الصحي الطارئ',      //20
            'المنح الدراسية للطلاب',    //21
            'حملة تنظيف الشاطئ' ,       //22


            'دعم علاج السرطان',               //12
            'كتب لدار الأيتام',               //13
            'تنظيف الحي',                     //14
            'مبادرة زراعة الأشجار',            //15
            'المساعدات الطبية للاجئين',         //16
            'أدوات تعليمية للأطفال في المناطق الريفية',  //17
            'حملة جمع النفايات',       //18
            'مراقبة جودة الهواء',      //19
            'الدعم الصحي الطارئ',      //20
            'المنح الدراسية للطلاب',    //21
            'حملة تنظيف الشاطئ' ,       //33
        ];

        $descriptions = [
            'جمع التبرعات لمساعدة مرضى السرطان في تحمل تكاليف العلاج الكيميائي.',
            'توفير الكتب التعليمية لدار الأيتام.',
            'تنظيم حملة تنظيف في حيّنا المحلي.',
            'الهدف هو زراعة 500 شجرة في المناطق الحضرية.',
            'توفير الاحتياجات الطبية الأساسية للعائلات النازحة.',
            'توزيع أدوات مدرسية للأطفال في القرى النائية.',
            'تحسين sanitation من خلال جمع النفايات المنظم.',
            'تركيب حساسات لتتبع التلوث في المدينة.',
            'الدعم الصحي الفوري للحالات الحرجة.',
            'مساعدة الطلاب من الأسر الفقيرة في الحصول على التعليم العالي.',
            'تنظيف النفايات البلاستيكية والقمامة من الشاطئ.',

            ////////////

            'جمع التبرعات لمساعدة مرضى السرطان في تحمل تكاليف العلاج الكيميائي.',
            'توفير الكتب التعليمية لدار الأيتام.',
            'تنظيم حملة تنظيف في حيّنا المحلي.',
            'الهدف هو زراعة 500 شجرة في المناطق الحضرية.',
            'توفير الاحتياجات الطبية الأساسية للعائلات النازحة.',
            'توزيع أدوات مدرسية للأطفال في القرى النائية.',
            'تحسين sanitation من خلال جمع النفايات المنظم.',
            'تركيب حساسات لتتبع التلوث في المدينة.',
            'الدعم الصحي الفوري للحالات الحرجة.',
            'مساعدة الطلاب من الأسر الفقيرة في الحصول على التعليم العالي.',
            'تنظيف النفايات البلاستيكية والقمامة من الشاطئ.',


            ///
            'جمع التبرعات لمساعدة مرضى السرطان في تحمل تكاليف العلاج الكيميائي.',
            'توفير الكتب التعليمية لدار الأيتام.',
            'تنظيم حملة تنظيف في حيّنا المحلي.',
            'الهدف هو زراعة 500 شجرة في المناطق الحضرية.',
            'توفير الاحتياجات الطبية الأساسية للعائلات النازحة.',
            'توزيع أدوات مدرسية للأطفال في القرى النائية.',
            'تحسين sanitation من خلال جمع النفايات المنظم.',
            'تركيب حساسات لتتبع التلوث في المدينة.',
            'الدعم الصحي الفوري للحالات الحرجة.',
            'مساعدة الطلاب من الأسر الفقيرة في الحصول على التعليم العالي.',
            'تنظيف النفايات البلاستيكية والقمامة من الشاطئ.'
        ];

        $locations = [
            'دمشق - المزة',           //1
            'حلب - الشهباء',          //2
            'حمص - شارع الدبلان',      //3
            'اللاذقية - الشاطئ' ,      //4
            'حماة - مورك' ,            //5
            'طرطوس - الناحية',         //6
            'إدلب - الدنا',            //7
            'درعا - ساحة الدلة',      //8
            'دمشق - الميدان' ,        //9
            'دمشق - المخيم' ,          //10
              'دمشق - المزة',           //11

            'دمشق - المزة',           //1
            'حلب - الشهباء',          //2
            'حمص - شارع الدبلان',      //3
            'اللاذقية - الشاطئ' ,      //4
            'حماة - مورك' ,            //5
            'طرطوس - الناحية',         //6
            'إدلب - الدنا',            //7
            'درعا - ساحة الدلة',      //8
            'دمشق - الميدان' ,        //9
            'دمشق - المخيم'   ,        //10
            'حلب - الشهباء',          //22

            'دمشق - المزة',           //1
            'حلب - الشهباء',          //2
            'حمص - شارع الدبلان',      //3
            'اللاذقية - الشاطئ' ,      //4
            'حماة - مورك' ,            //5
            'طرطوس - الناحية',         //6
            'إدلب - الدنا',            //7
            'درعا - ساحة الدلة',      //8
            'دمشق - الميدان' ,        //9
            'دمشق - المخيم'   ,        //10
            'حلب - الشهباء',          //33
        ];


        $photoRanges = [
                1 => [1, 4],
                2 => [5, 8],
                3 => [9, 12],
                4 => [13, 16],
        ];

        $classification_ids = [1, 2, 3, 4 , 1, 2, 3, 4 , 1, 2, 3
                                , 1, 2, 3, 4 , 1, 2, 3, 4 , 1, 2, 3
                            , 1, 2, 3, 4 , 1, 2, 3, 4 , 1, 2, 3]; // healthy, Educational, cleanliness, environmental


        $acceptance_status_ids = [1, 2, 3 , 2 , 1, 2, 3 , 2 , 1, 2, 3,
                                    1, 2, 3 , 2 , 1, 2, 3 , 2 , 1, 2, 3,
                                1, 2, 3 , 2 , 1, 2, 3 , 2 , 1, 2, 3]; // Under review, Approved, Rejected


        $campaign_status_ids = [2, 1, 2 , 3 , 2, 1, 2 , 3 , 2, 1, 2
                                  ,2, 1, 2 , 3 , 2, 1, 2 , 3 , 2, 1, 2
                                ,2, 1, 2 , 3 , 2, 1, 2 , 3 , 2, 1, 2]; // Active, Closed, Complete

        $user_id = [ 2 , 2 , 2 , 2  , 2 , 2 , 2 , 2 , 5 , 5, 5,
                       5 , 5, 5, 5 , 6, 6, 6, 6 , 7, 7, 7,
                        6,6,6,6, 7,7,7,7 ,8,8,8];

        $emergency_level = [1,2,2,5,3,2,3,5,4,1,4 , 1,2,2,5,3,2,3,5,4,1,4 , 1,2,2,5,3,2,3,5,4,1,4];
        $amount_required = [70000,50000,100000,20000,30000,20000,30000,50000,40000,100000,40000,
        70000,50000,100000,20000,30000,20000,30000,50000,40000,100000,40000
    ,70000,50000,100000,20000,30000,20000,30000,50000,40000,100000,40000];

        for ($i = 0; $i < 33; $i++) {
        $startTime = null;
        $endTime = null;

        if ($acceptance_status_ids[$i] == 2) {
            $startTime = Carbon::now();
            $endTime = (clone $startTime)->addDays(rand(7, 30));
        }

            IndCompaign::query()->create([
                'title' => $titles[$i],
                'description' => $descriptions[$i],
                'classification_id' => $classification_ids[$i],
                'location' => $locations[$i],
                'amount_required' => $amount_required[$i],
                'user_id' => $user_id[$i],
                'photo_id' => rand(...$photoRanges[$classification_ids[$i]]),
                'acceptance_status_id' => $acceptance_status_ids[$i],
                'campaign_status_id' => $campaign_status_ids[$i],
                'compaigns_start_time' => Carbon::now()->subDays(rand(1, 10)),
                'compaigns_end_time' => Carbon::now()->addDays(rand(10, 30)),
                'compaigns_time' => rand(7, 30),
                'emergency_level' => $emergency_level[$i],

            ]);
        }
    }
}
