<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\InkindDonation;

class InkindDonationsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $donation_type_id = [
            1, // ملابس     1
            2, // مواد غذائية    2
            3, // أثاث    3
            3, //أثاث    4
            1, //ملابس   5
            1, // ملابس   6
            4, // أدوات كهربائية  7
            5, // 8 كتب وأدوات تعليمية
            6, // أدوات طبية 9
            5,  // كتب وأدوات تعليمية 10


            /////////

            1, // ملابس     1
            2, // مواد غذائية    2
            3, // أثاث    3
            3, //أثاث    4
            1, //ملابس   5
            1, // ملابس   6
            4, // أدوات كهربائية  7
            5, // 8 كتب وأدوات تعليمية
            6, // أدوات طبية 9
            5,  // كتب وأدوات تعليمية 10

        ];


        $name_of_donation = [
            'ملابس شتوية للأطفال',     //1
            'سلال غذائية متكاملة',    //2
            'أسرّة خشبية مع فرش',     //3
            'حرامات شتوية',          //4
            'ملابس مدرسية لأطفال الابتدائي',   //5
            'ديارة طفل حديث الولادة' ,         //6
            'بطاريات ليدات' ,          //7
            'كتب تاسع وبكالوريا' ,     //8
            'أدوية سكر وضغط',     //9
            'قرطاسية مدرسية كاملة',     //10


            ////////مشان التكرار بكل مركز
            'ملابس شتوية للأطفال',     //11
            'سلال غذائية متكاملة',    //12
            'أسرّة خشبية مع فرش',     //13
            'حرامات شتوية',          //14
            'ملابس مدرسية لأطفال الابتدائي',   //15
            'ديارة طفل حديث الولادة' ,         //16
            'بطاريات ليدات' ,          //17
            'كتب تاسع وبكالوريا' ,     //18
            'أدوية سكر وضغط',     //19
            'قرطاسية مدرسية كاملة',     //20

        ];

        $amount = [
            40,     //1
            25,     //2
            23,     //3
            50,     //4
            100,    //5
            5,      //6
            25,     //7
            30,     //8
            100,    //9
            100 ,    //10

            //////

            40,     //1
            25,     //2
            23,     //3
            50,     //4
            100,    //5
            5,      //6
            25,     //7
            30,     //8
            100,    //9
            100     //10
        ];

        $description = [
            'معاطف، كنزات، بناطيل شتوية بحالة ممتازة',
            'أرز، سكر، زيت، معلبات، شاي',
            'أسرّة مفرد بحالة جيدة مع فرش نظيف',
            'حرامات شتوية مفردة جديدة بسماكة متوسطة',
            'صداري أطفال بمقاسات من 1 وحتى 3 جديدة',
            'ديارة كاملة لأطفال حديثي الولادة بحالة جيدة ',
            'بطاريات لسيارات مستعملة للتوصيل على ليدات المنزل باستطاعة عالية',
            'مجموعة كتب كاملة لطلاب التاسع والبكالوريا منهاج حديث',
            'أدوية السكر والضغط (نورموتين/غليبتين) بتاريخ صلاحية جديد وعيارات مختلفة',
            'دفاتر-أقلام-حقائب-أحذية مدرسية لأعمار مختلفة',

            ////////////////
            'معاطف، كنزات، بناطيل شتوية بحالة ممتازة',
            'أرز، سكر، زيت، معلبات، شاي',
            'أسرّة مفرد بحالة جيدة مع فرش نظيف',
            'حرامات شتوية مفردة جديدة بسماكة متوسطة',
            'صداري أطفال بمقاسات من 1 وحتى 3 جديدة',
            'ديارة كاملة لأطفال حديثي الولادة بحالة جيدة ',
            'بطاريات لسيارات مستعملة للتوصيل على ليدات المنزل باستطاعة عالية',
            'مجموعة كتب كاملة لطلاب التاسع والبكالوريا منهاج حديث',
            'أدوية السكر والضغط (نورموتين/غليبتين) بتاريخ صلاحية جديد وعيارات مختلفة',
            'دفاتر-أقلام-حقائب-أحذية مدرسية لأعمار مختلفة'

        ];

        $status_of_donation_id = [
            2, // مستعمل - بحالة ممتازة
            1, // جديد
            3, // مستعمل - بحالة جيدة
            1,
            2,
            2,
            3,
            2,
            1,
            2,

            ///////
            2, // مستعمل - بحالة ممتازة
            1, // جديد
            3, // مستعمل - بحالة جيدة
            1,
            2,
            2,
            3,
            2,
            1,
            2
        ];

        $center_id = [
            1, // مركز الهلال الأحمر
            2, // مركز الإغاثة الإنسانية
            1, // مركز الهلال الأحمر
            3,
            4,
            5,
            6,
            7,
            8,
            9,

            ////////

            2,
            1,
            3,
            4,
            2,
            2,
            3,
            3,
            1,
            4,

        ];

        $owner_id = [
            5,
            6,
            7,
            8,
            9,
            10,
            5,
            7,
            9,
            8,

            /////////
            5,
            6,
            7,
            8,
            9,
            10,
            5,
            7,
            9,
            8
        ];

        $inkindDonation_acceptence_id = [1,2,2,1,1,2,2,1,1,1,1,2,2,1,1,2,2,2,2,2];

        for ($i = 0; $i < count($donation_type_id); $i++) {
            InkindDonation::create([
                'donation_type_id'      => $donation_type_id[$i],
                'name_of_donation'      => $name_of_donation[$i],
                'amount'                => $amount[$i],
                'description'           => $description[$i],
                'status_of_donation_id' => $status_of_donation_id[$i],
                'center_id'             => $center_id[$i],
                'owner_id'              => $owner_id[$i],
                'inkindDonation_acceptence_id' => $inkindDonation_acceptence_id[$i]

            ]);
        }
    }
}
