<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\VolunteerTask;

class VolunteerTasksSeeder extends Seeder
{
    public function run()
    {
        $names = [
            'تنظيم الفعاليات',      //1
            'التوعية المجتمعية',    //2
            'الدعم اللوجستي',      //3
            'مسؤول تنظيفات',      //4
            'إدخال بيانات',          //5
            'رسم على الجدار',        //6
                'تنظيم الفعاليات',   //7
            'التوعية المجتمعية',          //8
            'الدعم اللوجستي',           //9
                'مسؤول تنظيفات',   //10
            'إدخال بيانات',           //11
            'رسم على الجدار',      //12
                'تنظيم الفعاليات',    //13
            'التوعية المجتمعية',     //14
            'الدعم اللوجستي',       //15
                         'مسؤول تنظيفات' ,         //16
            'إدخال بيانات',         //17
            'رسم على الجدار',         //18
                'تنظيم الفعاليات',       //19
            'التوعية المجتمعية',          //20
            'الدعم اللوجستي',             //21
                         'مسؤول تنظيفات',        //22
            'إدخال بيانات',           //23
            'رسم على الجدار',           //24
                  'تنظيم الفعاليات',       //25
            'التوعية المجتمعية',          //26
            'الدعم اللوجستي',                //27
        ];

        $descriptions = [
            'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
            'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
            'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
            'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
               'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
               'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
               'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
               'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
               'المساعدة في تنظيم وإدارة الفعاليات التطوعية.',
            'تنفيذ حملات توعية في المجتمع.',
            'توفير الدعم اللوجستي للحملات المختلفة.',
        ];

        $hours = [5, 3, 4 , 5, 3, 4 , 5, 3, 4 ,5, 3, 4, 5, 3, 4 , 5, 3, 4 , 5, 3, 4 , 5, 3, 4 , 5, 3, 4];

        $number_volunter_need =  [10 , 20 , 25 , 10 , 20 , 25 ,10 , 20 , 25 ,10 , 20 , 25 , 10 , 20 , 25,10 , 20 , 25,10 , 20 , 25,10 , 20 , 25,10 , 20 , 25];


        $association_campaign_id =[ 4,8,15,19,26,30 ,  4,8,15,19,26,30 , 3,4,7,8,11,14,15,18,19,22,25,26,29,30,33];


        for ($i = 0; $i < 27 ; $i++) {
            VolunteerTask::create([
                'name' => $names[$i],
                'description' => $descriptions[$i],
                'hours' => $hours[$i],
                'association_campaign_id' => $association_campaign_id[$i],
                'number_volunter_need' => $number_volunter_need[$i]
            ]);
        }
    }
}
